Config/DataProcessors/КадровыеПерестановки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>КадровыеПерестановки</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Должность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Documents/ПереводСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПереводСотрудника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КадровыеПеремещения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/КадровыеПерестановки/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПровестиОдногоНаСервере(СотрудникСсылка, НовыеДанные)
	
	Попытка		
		// Создаём документ ПриёмНаРаботу
		Документ = Документы.ПереводСотрудника.СоздатьДокумент();
		
		// Заполняем документ
		Документ.Сотрудник = СотрудникСсылка;
		Документ.Подразделение = НовыеДанные.Подразделение;
		Документ.Должность = НовыеДанные.Должность;
		Документ.Оклад = НовыеДанные.Оклад;
		Документ.Дата = НовыеДанные.ДатаДокумента;
		
		// Записываем документ
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Сообщить("Ошибка: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Документ.Проведен;
	
КонецФункции

&НаКлиенте
Процедура Провести(Команда)
	
	СтатусПроведения = Истина;
	
	Для Каждого Строка Из Объект.Сотрудники Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НовыеДанные =  ПолучитьСтруктуруДанныхСотрудникаССервера();
		НовыеДанные.Подразделение = Строка.Подразделение;
		НовыеДанные.Должность = Строка.Должность;
		НовыеДанные.Оклад = Строка.Оклад;
		НовыеДанные.ДатаДокумента = Строка.Дата;
		
		Если ПровестиОдногоНаСервере(Строка.Сотрудник, НовыеДанные) = Ложь Тогда
			СтатусПроведения = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтатусПроведения = Истина Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	Попытка
		
		ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
		
		// Проверяем, что сотрудник уже в штате
		Если Не СотрудникВШтатеНаСервере(ТекущаяСтрока.Сотрудник) Тогда
			
			Сообщить("Сотрудника """ + ТекущаяСтрока.Сотрудник + """ нет в штате!");
			ТекущаяСтрока.Сотрудник = Неопределено;
			Возврат;
			
		КонецЕсли;
		
		// Получаем данные сотрудника для заполнения полей
		ИнфоСотрудника = ПолучитьДанныеСотрудникаССервера(ТекущаяСтрока.Сотрудник);
		
		// Заполняем поля текущими данными сотрудника
		ТекущаяСтрока.Подразделение = ИнфоСотрудника.Подразделение;
		ТекущаяСтрока.Должность = ИнфоСотрудника.Должность;
		ТекущаяСтрока.Оклад = ИнфоСотрудника.Оклад;
		ТекущаяСтрока.Дата = ТекущаяДата();
		
	Исключение
		
		Сообщить("Ошибка: " + ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры
  
  
  &НаСервере
  Функция СотрудникВШтатеНаСервере(СотрудникСсылка)
	  
	  Возврат СотрудникВШтате(СотрудникСсылка);
	  
  КонецФункции

  
  &НаСервере
  Функция ПолучитьДанныеСотрудникаССервера(СотрудникСсылка)
	  
	  Возврат ПолучитьДанныеСотрудникаПоСсылке(СотрудникСсылка);
	  
  КонецФункции
  
  
  &НаСервере
  Функция ПолучитьСтруктуруДанныхСотрудникаССервера()
	  
	  Возврат СоздатьДанныеСотрудника();
	  
  КонецФункции


&НаКлиенте
Процедура СотрудникиОкладПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
	МРОТ = ПолучитьМРОТССервера();
	
	Если ТекущаяСтрока.Оклад < МРОТ Тогда
		Сообщить("Оклад не может быть ниже МРОТ!");
		ТекущаяСтрока.Оклад = МРОТ;
	КонецЕсли;
	
  КонецПроцедуры


&НаСервере
  Функция ПолучитьМРОТССервера()
	  Возврат Константы.МРОТ.Получить();
  КонецФункции
